greengraph/app/controllers/analytics_controller.rb

      #NOT USED @totalenergy = @totalenergy / 730.484

      #for date range dropdowns
      @daterange = Reading.pluck(:read_date).map!{|x| x.strftime("%Y").gsub(/,/, '')}.uniq
---
SELECT "readings"."read_date" FROM "readings" WHERE (business_class = 'Commercial' and gas_billed IS NOT NULL and city_code = 'PRINCETON BORO') AND ("readings"."read_date" BETWEEN '2009-01-01 00:00:00.000000' AND '2009-12-01 00:00:00.000000') AND ("readings"."read_date" BETWEEN '2009-01-01 00:00:00.000000' AND '2009-12-01 00:00:00.000000')