greengraph/app/controllers/api_controller.rb

SELECT "readings".* FROM "readings"
---
  def raw
      @alldata = Reading.all